Revit 2027 API
Space.Zone Property
Note: This API is now obsolete.
Reports this space belong to which Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
public Zone Zone { get; }
<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>
Public ReadOnly Property Zone As Zone
	Get
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")]
property Zone^ Zone {
	Zone^ get ();
}
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and may be removed in a future version of Revit. Please use the GenericZone object and their properties instead.")>]
member Zone : Zone with get
Property Value
Zone
Remarks
This property is used to retrieve the host zone of this space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace